// 小組 學生資訊 (名字學號) 
// 作業:多項式相加 
// 將A多項式與B多項式相加(A+B)，放進陣列
// 並將其結果印出來 
// 如係數或冪次為零無須印出 
// A-B可自由選擇做
/****請註解 ****/ 
//檔名請加上第幾組(ex.多項式練習_第X組) 
#include <iostream> 
#include <cstdlib>
using namespace std;
int main(void)
{
	// A多項式 10x^8+6x^5-7x^4-3x^2+5
	// B多項式 -2x^10-10x^8+7x^7+3x^4-2x^3-3x^2+x^1 
    int p[2][30] = {{10,6,-7,-3,5,-2,-10,7,3,-2,-3,1},{8,5,4,2,0,10,8,7,4,3,2,1}};

	int a_s = 0, a_f = 4;	//A多項式的開始與結束位置 
	int b_s = 5, b_f = 11;	//B多項式的開始與結束位置 
	int avail = 12;			//下個可用空間位置 
	
	//過程 
	
	
  	system("PAUSE");
	return 0;
}

